{
  "title": "FAQ",
  "t_wifiConn": "Can not connect to mobile VTS.",
  "t_wireLessConn": "WireLess",
  "ul_phoneShowsConnected": "If device show connected",
  "ul_phoneNotConnected": "if device show not connected or waiting for connection",
  "li_runInAdmin": "Start Vitamins in admin mode",
  "li_iosLocalNet": "IOS device - setting - Privacy - Local Network - turn on VTS",
  "li_connToSameRouter": "Make sure pc and mobile device connected to same router",
  "li_showIp": "compare IPv4 address in 'Show IP' and PC Network Settings.",
  "p_compareIP": "If the first three do not match, The device is on a different network segment from the pc OR not under same router",
  "p_traDirectConn": "You may try hotspot, USB Network sharing , to build a direct connection between device and pc",
  "li_settingNotSame": "If Ip address in Setting - Wi-Fi and in 'Show IP' are not the same.",
  "p_useSetting": "Try use address in Setting.",
  "t_vtslag": "VTS laggy, jitter",
  "p_mech": "Vitamins has an internal mechanism to avoid this problem, but jitter caused by other plugins or VTS itself can still affect Vitamins. Jitter in the video above may be caused by this sequence of events:",
  "li_conti": "Requests sent continuously by the plugin to the VTS.",
  "li_block": "VTS plugin server blocking.",
  "li_render": "The rendering section cannot receive data from the plugin and switches back to the default input after a timeout.",
  "li_comone": "The VTS plugin server takes a few seconds to complete one request, but hundreds or thousands of requests are still in the queue.",
  "li_renderrec": "The rendering section receives the plugin data and switches to the plugin input.",
  "li_still": "VTS plugin server is still blocking.",
  "p_occurs": "The jitter you see occurs when VTS constantly switch the input source.",
  "p_nodef": "In addition, when no default input source (VTS native tracking devices) is connected, the model will get stuck until the next plugin request is processed successfully.",
  "p_tored": "To reduce the chance of this problem, you can turn off other plugins, turn off the 'fetch VTS parameter data' option within Vitamins or reduce the processing rate to reduce the pressure on the VTS plugin server.",
  "p_vtscould": "VTS could also have internal mechanisms to deal with this problem. For example, VTS will create and keep several new threads after facing a jitter. Which means the further jitter will be less intense.",
  "bq_monitor": "You can monitor the above mechanisms in the Task Manager details tab by turning the column of the thread visible.",
  "st_above": "If the above description differs from what you are experiencing, you can refer to the official VTS documentation on lagging issues.",
  "a_lag": "lagging issues"
}