{
    "title": "Prefix",
    "p_principle": "The principle of Prefix is to remap your face's expressions range onto the standard field, simple and powerful.",
    "p_toAch": "It's very simple and intuitive to achieve this, you just need to let Vitamins know the default and extreme values of your expressions.",
    "t_howto": "How to Prefix",
    "t_blendshapes": "Blendshapes",
    "clicktoquick": "First, click on the Calibrate button below and follow the prompts to complete the quick calibration, this will set the default values for all inputs parameters.",
    "openPrefix": "Then, e.g. click on the browInnerUp value to open the Prefix page.",
    "bq_valuetop": "The value at the top of this card are the original value, the rest is the operating area. The value at left is the minimum, the right is maximum. The triangle pointing downwards indicates the position of the default value(zero point), while the other indicate the maximum.",
    "keephead": "Keeping the head still, take this value as far as you can, hold it, and click the ']' button.",
    "bq_dk": "If you don't know how to make this expression, right-click on the value and Vitamins will loop the expression animation for you. You can also manually show and control expression by clicking on the slider settings and face model buttons below.",
    "p_finetune": "If you want to fine-tune the prefix values, you can try dragging the two slider bars below, or enter the numbers manually.",
    "p_atthispoint": "At this point you have prefixed one blendshape. You will need to do this for all blendshapes that you cannot do the full 0-1 range.",
    "t_posrot": "position and rotation",
    "simToBlend": "This section is similar to blendshapes, except that you need to set the minimum value additionally.",
    "quickCali": "First, complete the quick calibration, this will set the default value (zero point)",
    "takeHeadrotY": "Take the headRotY as an example. Turn your head to the right of yourself to the maximum position you think you can reach when streaming, press ']', then turn to the left, do the same and press '['.",
    "bq_lefthand": "Vitamins uses a left-handed coordinate system to represent position and rotation in 3D space.",
    "t_rePrefix": "When to Re-Calibrate",
    "s_beforesteam": "Before each streaming, a quick calibration should be completed by clicking the Calibrate button below. As there may be slight differences in the face every day, performing a quick calibration will maintain the high accuracy of the capture.",
    "bq_skip": "If you feel that the 5 second wait is too long, you can right click on the button to calibrate immediately.",
    "s_Note": "The prefix normally only needs to be calibrated once. However, recalibration will be required in the following cases.",
    "li_newdev": "When using new tracking devices.",
    "li_diffSolu": "When using different face capture solutions, such as switch from IOS to Nvidia broadcast.",
    "li_campos": "Significant changes happened in camera placement. For example, moving the camera from front to side.",
    "li_growup": "During your activities as a facial capture actor, the range of your face's capabilities may change due to prolonged practice, in which case you may, and are advised to, adjust the prefix to the modified blendshapes."
}