{
    "title": "Getting Started",
    "intro": {
        "title": "Quick Intro",
        "why": "Why Vitamins",
        "p1_middleware": " Vitamins is a middleware between face capture devices and rendering softwares. Vitamins calculates and packages the face capture data in a user defined way into Parameters and send to rendering softwares.",
        "p2_rendering": "While rendering software typically wraps raw data into Live2D standard input parameters for the user to use, Vitamins uses more raw data from face capture devices. This allows Vitamins to calibrate and calculate in an accurate and normalised way.",
        "p4_stand": "The standardized calibration allows different faces to perform the same range of values, but also keeps individual characteristics due to differences in muscles, expression habits, etc.",
        "p5_benefit": "The benefits is:",
        "p6_For_Actor": "For Actor(Vtuber), Live2D models, items, and Vitamins saves created under this standardized range of facial expressions can be used right out of the box. ",
        "p7_which_means": "Which means, users no longer has to calibrate, config each model, saves individually.",
        "p8_editor": "Vitamins' Parameters editor allows users to create parameters with custom names, ranges, blend modes, and calculation programs.",
        "p9_calcu": "The calculation part here have two modes. Users can use the function (expression) mode for relatively simple calculations. Or user can use the programming mode for more powerful processing.",
        "link_drink_straw": "drinkWithStraw"
    },
    "req": {
        "title": "Requirements",
        "hardware": {
            "title": "Hardware",
            "p1_follow_types": "Vitamins currently supports the following types of capture inputs.",
            "bq1_onios": "Face capture on IOS devices relies on the TrueDepth camera to work. This hardware is installed on all Iphone devices from the Iphone X onwards, as well as on the third gen ipad pro and later Ipad devices.",
            "bq2_rtx": " Requires RTX 2060 and later RTX graphics cards, available on Nvidia graphics cards only. Requires the"
        },
        "software": {
            "title": "Software",
            "p1_render": "Vitamins itself does not have the ability to render output - the rendering and display of models is dependent on additional software, currently only available with"
        }
    },
    "instal": {
        "title": "Installation",
        "p1_down": "You can now download Vtiamins from the release page on github.",
        "p2_run": "Extract the zip archive to any location and run Vitamins.exe to start the program."
    }
}