{
  "integratingVitaminsIntoWorkflow": "Integrating Vitamins into Workflow",
  "duringDevelopment": "During Development",
  "preModelingRequirements": "What do I need to do before rigging?",
  "learnVtuberContent": "Learn the content as part of as a VTuber.",
  "completePreProcessingCalibration": "Complete prefix calibration.",
  "understandParameterActions": "Learn how to know the actions of parameters.",
  "differencesDuringModeling": "What will be different during rigging?",
  "vitaminsNotChangeModeling": "Vitamins will not change Live2D rigging development; it is simply a driving tool.",
  "rangeOfMotionInLive2D": "You decide the how the model should move in Live2D Cubism, and Vitamins helps you drive it.",
  "modelingUsingFamiliarMethods": "You can rig as the way you used to.",
  "additionalParameterDrivenModels": "If you want to use additional parameters from built-in script, read 'How can I know the action of a parameter?' It will be helpful for modeling.",
  "learningParameterDevelopment": "If you want to develop parameters or collaborate with parameter script developers, refer to 'Do I need to learn script  development?'",
  "preProcessingCalibrationAdvantages": "Why do I also need to complete prefix calibration?",
  "ensureModelTestingEffectiveness": "You need to ensure the effectiveness of testing the model before delivery.",
  "convenienceOfPreProcessingCalibration": "Prefix calibration can also provide many conveniences for the workflow. Please refer to the 'advantages of prefix calibration' for details.",
  "summaryForClientHandover": "In summary, after completing prefix calibration, the VTS configuration file you configured for yourself can be directly used by your clients with little to no reconfiguration. This will greatly reduce the workload of the handover progress.",
  "knowingParameterCorrespondingAction": "How can I know the action of a control parameter?",
  "builtInArchiveParameters": "In the built-in scripts, parameters name are the same as the built-in parameters in VTS, and the actions are the same.",
  "nonMatchingParameters": "For additional parameters, their names usually correspond to the blendshapes in the input panel.",
  "playingActionDemoAnimation": "You can right-click on the corresponding blendshape to play the demonstration animation.",
  "nonBuiltInArchive": "If you are using script from others, expand the parameter; the parameter developer is likely to leave comments there. which could be helpful.",
  "needToLearnParameterDevelopment": "Do I need to learn script development?",
  "parameterDevelopmentInVitamins": "In the Vitamins workflow, script development can be separate from modeling. You can choose to write scripts by yourself or collaborate with parameter script developers.",
  "benefitsOfPreProcessingDesign": "Thanks to the design of prefix, parameter script developers can work independently based on the requirements you provide, without Live2d model work file and only need to handover with you.",
  "howToPresentRequirementsToParameterScriptDevelopers": "How to present my requirements to parameter script developers?",
  "mainConcernsOfParameterDevelopers": "Parameter developers are mainly concerned about the following aspects:",
  "parameterLogic": "The logic of this parameter",
  "effectsOfCorrespondingLive2DParameter": "The effects you want to perform of the Live2D parameter.",
  "minMaxDefaultValueOfCorrespondingLive2DParameter": "The minimum value, maximum value, and default value of the Live2D parameter.",
  "requirementsExample1": "Requirement Example 1:",
  "surpriseAnimationWithStars": "I want to create an effect where stars appear around the eyes when surprised, and then quickly retract after a period of time.",
  "progressParameterForStarAnimation": "I want you to write a parameter that controls the progress of the animation parameters for the appearance of stars.",
  "defaultValueMinMax": "The default value of this Live2D parameter is 0, the minimum value is also 0, and the maximum value (the last frame of the animation) is 1.",
  "logicDescription": "The logic is as follows:",
  "increaseToMaxValueWhenEyesOpen": "When it detects that the eyes suddenly open wide, it increases from the minimum value to the maximum value in 0.5 seconds according to the ... curve. After reaching the maximum value, it should be maintained for at least 0.5 seconds.",
  "returnToMinValueWhenEyesClosed": "When the eyes are no longer wide open, it decreases from the maximum value to the minimum value in 0.5 seconds according to the ... curve.",
  "requirementsExample2": "Requirement Example 2:",
  "noFrowningWhenSmiling": "I want to prevent frowning when smiling.",
  "controlBrowHeightParameters": "I want you to write a set of parameters that control the height of the eyebrows (BrowLeftY and BrowRightY). Based on the built-in BrowLeftY and BrowRightY parameters, add the logic that those will not be lower than 50% when the smile exceeds 80%.",
  "deliveringToClient": "Handover to the client",
  "deliveryContents": "Delivery Contents",
  "modelFolder": "In Model folder:",
  "modelFiles": "Live2d Model files",
  "yourConfiguredVTSFile": "Your configured VTS configuration file (.vtuber.json)",
  "vitaminsFiles": "Vitamins files:",
  "yourUsedVitaminsScript": "Vitamins script file (.vps) Your used",
  "assistingInDebugging": "Assisting in setting up",
  "preProcessing": "prefix:",
  "althoughNotNecessary": "Although it is not necessary for you to assist in completing this, but still need to take into account that any help material from fixed content may not be able to cater for everyone, the client may still have doubts after the help of demonstration animations and prefix tutorials. Assisting the client in completing prefix will ensure the stability of the model's performance.",
  "VTSDebugging": "VTS setting up:",
  "ifYouDeliveredVTSFile": "If you have delivered your VTS configuration file, you only need to adjust the parameters affected by the speaking habits for the client, usually only the MouthOpen parameter. Different speaking habits can result in different proportions of how wide the mouth opens when speaking."
}