{
  "title": "Use",
  "connection": "Connection",
  "connect_device_vts": "The two indicators on the left side are connection indicators of the capture device and VTS.",
  "connect_capture_device": "Connect Capture Device",
  "click_first_indicator": "Click the first indicator to display all supported capture devices and their connection types.",
  "select_capture_device": "After selecting a capture device, you can click the '?' icon next to the title to view the specific connection steps.",
  "indicator_green_after_connection": "After the connection is established, this indicator will turn green.",
  "connect_vts": "Connect VTS",
  "click_second_indicator": "Click the second indicator to display the VTS connection card.",
  "show_vts_connection_card": "All running VTS will be displayed. Click the connect icon and then click 'Allow' in VTS to complete the connection.",
  "preprocessing_calibration": "Prefix Calibration",
  "preprocessing_improves_accuracy": "Completing the Prefix calibration can greatly improve the accuracy of capture and relieve you from dealing with script code and model configuration.",
  "learn_how_to_preprocess": "If you want to know how to complete the Prefix, please refer to ",
  "a_prefix": "Prefix",
  "click_question_button_after_device_connection": "You can also click the '?' button at the bottom after connecting the capture device. It contains interactive guidance to help you quickly get started with prefix calibration.",
  "import_use_archive": "Import and Use Script",
  "each_script_archive_drives_model": "Each script drives the model in different ways. Typically, the modeler will provide you with a script that is bound to your model.",
  "import_archive_click_right_side": "To import this script, first click on the right side icon",
  "open_script_archive_manager": "to open the script save manager.",
  "click_import_icon": "Then click the import icon and copy the .vps file provided by the modeler into the popup folder.",
  "find_imported_archive_in_list": "You can then find the imported script in the script list and load it.",
  "reconfigure_model_in_vts": "If your modeler did not use Vitamins to create your model, you can also use the built-in scripts. However, in this case, you will need to reconfigure your model in VTS."
}