{
    "preProcessingCalibrationAdvantages": "Advantages of Prefix Calibration",
    "calibrationLimitationsInTraditionalSoftware": "Limitations of Calibration in Traditional Software",
    "inCurrentLive2dMotionCaptureApplications": "In current Live2d motion capture applications, high-precision facial capture data is typically composed of 52 Arkit Blendshapes. These Blendshapes represent the degree of facial expressions on a range of 0-1, where 0 represents a neutral expression and 1 represents the maximum expression. Due to individual differences, different people have different numerical ranges for the same facial expression.",
    "inCommonLive2dRenderingSoftware": "In common Live2d rendering software,  Arkit Blendshapes are often precomputed and packaged as control parameters before provides to user for parameter mapping .",
    "inThisModeUsersAreProvidedWithCalibrationOptions": "In this mode, users are provided with calibration options:",
    "zeroPointCalibration": "Zero-Point Calibration",
    "inVariousSoftwareThisIsOftenReferredToAsCalibration": "In various software, this is often referred to as calibration, one-click calibration, etc.",
    "thisTypeOfCalibrationProvidesTheAbility": "This type of calibration provides the ability to set the value of the current frame's Arkit Blendshapes or control parameters as the new zero point when calibrate button clicked.",
    "controlParameterRemapping": "Parameter Remapping",
    "thisTypeOfCalibrationAllowsUsersToRemapTheRange": "This type of calibration allows users to remap the range of what they can achieve onto the complete range of the control parameter.",
    "itIsEvidentThatInSuchCalibration": "It is evident that in such calibration functionality, users do not have the ability to calibrate beyond the zero point for Arkit Blendshapes.",
    "thisLeadsToTheFactThatTheActualRangeOf": "This leads to the fact that the actual range of values users can achieve for Arkit Blendshapes when 'computed and packaged as Live2d control parameters' is still unknown and uncontrollable. This may cause the calculated range of values to deviate from the expected range and affect subsequent remapping calibration.",
    "considerASimpleExampleForTheParameter": "Let's consider a simple example for the parameter BrowLeftY. The calculation expression might be: 0.5 + (browInnerUp - browDown_L) / 2.",
    "letUsAssumeThatForAnIndividual": "Let us assume that for an individual, after zero-point calibration, the maximum value for BrowInnerUp is 20% of 1, while BrowDown_L can reach 100%.",
    "thusTheActualBrowLeftYRangeFor": "Thus, the actual BrowLeftY range for this individual is [0, 0.6], and it is not symmetric around 0.5 as expected.",
    "ifThisIndividualWishesToUseRemapping": "If this individual wishes to use remapping to fix this issue and achieve complete control of the model when raising the eyebrows, it will encounter the following dilemma:",
    "forExampleInVTSIfOnlyTheMaximum": "For example, in VTS, if the maximum input value is set to 0.6, then at the neutral expression (0.5), due to the VTS remapping algorithm, the output value (on the right side) will bias towards the maximum value. This will result in constantly raised eyebrows in the model.",
    "moreComplexControlParameters": "More complex control parameters may be affected even more significantly, such as MouthForm.",
    "advantagesOfPreProcessingCalibration": "Advantages of Prefix Calibration",
    "preProcessingProvidesBothZeroPointCalibrationAndRemapping": "Prefix provides both zero-point calibration and remapping for Blendshapes. It allows users to map their actual expression range to the standard expression range.",
    "oneCouldSayThatEveryIndividual": "One could say that every individual who finished Prefix calibration will have the same standardized face.",
    "itIsEvidentThatStandardizing": "It is evident that standardizing the value range before the calculation begins will avoid deviations explaned above and the impact on subsequent remapping calibration.",
    "regardingModelHandover": "Regarding Model Handover",
    "whenAModelArtistConfigures": "VTS configuration file (.vtube.json) can be directly used by clients or collaboraters and almost have no need for re-configuration.",
    "noteThatForMouthOpen": "Note that for MouthOpen, the size of mouth opening during speech show different proportions to maximum for different individuals due to habits. Only for this parameter, reset maximum value in VTS could effectively enhances model performance.",
    "regardingParameterScriptDevelopment": "Regarding Parameter Script Development",
    "duringTheScriptDevelopment": "During the script development process, developers can focus on requirements without the need to adapt to a single specific object. The produced script will be applicable to all individuals."
}